%                         Μηχανική Μάθηση
%                   1η Σειρά Ασκήσεων 2023-2024
%                  Άσκηση 1.3: Bayes Classifier
% -------------------------------------------------------------------------
%                   Χαρίλαος Κουκουλάρης el18137
%                           8/12/2023

mi1 = [-2; 0];
mi2 = [2; 1];

x = -2:0.2:2;
x = [x ; x];

% x0 = (μ1 + μ2) / 2
x0 = (mi1 + mi2) / 2;

%% α) ----------------------------------------------------------------------

Sigma1 = eye(2);

% θ = Σ^-1(μ1 - μ2)
theta1 = Sigma1^-1 * (mi1 - mi2);
g1 = theta1' * (x - x0);

%% β) ----------------------------------------------------------------------

Sigma2 = [1 -0.6; -0.6 1];

% θ = Σ^-1(μ1 - μ2)
theta2 = Sigma2^-1 * (mi1 - mi2);

% g(x) = θ^Τ (x - x0)
g2 = theta2' * (x - x0);

%% γ) ----------------------------------------------------------------------

% λ12 = 1, λ21 = 0.5
lambda12 = 1;
lambda21 = 0.5;

% x0 = 1/2 (μ1 + μ2) - ln(P(ω1) / P(ω2)) (μ1 - μ2) / ((μ1 - μ2)^Τ Σ^-1 (μ1 - μ2))
x3 = x0 - log(lambda12 / lambda21) * (mi1 - mi2) / sqrt((mi1 - mi2)' * Sigma2^-1 * (mi1 - mi2));

% g(x) = θ^Τ (x - x0)
g3 = theta2' * (x - x3);

%% δ) ----------------------------------------------------------------------

rng('default')

% Σημεία κατανομών ερωτήματος α
R1 = mvnrnd(mi1,Sigma1,200);
R2 = mvnrnd(mi2,Sigma1,200);

% Απεικόνιση σημείων κατανομών και επιφάνειας απόφασης ερωτήματος α
figure
hold
scatter(R1(:,1),R1(:,2))
scatter(R2(:,1),R2(:,2),'square')
plot(x,g1,'--')
grid
title('Naive Bayes Classifier')
legend('\omega_1','\omega_2')
xlabel('x_1')
ylabel('x_2')
ylim([-3 6])

% Σημεία κατανομών ερωτήματος β και γ
R1 = mvnrnd(mi1,Sigma2,200);
R2 = mvnrnd(mi2,Sigma2,200);

% Απεικόνιση σημείων κατανομών και επιφάνειας απόφασης ερωτήματος β
figure
hold
scatter(R1(:,1),R1(:,2))
scatter(R2(:,1),R2(:,2),'square')
plot(x,g2,'--')
grid
title('Naive Bayes Classifier')
legend('\omega_1','\omega_2')
xlabel('x_1')
ylabel('x_2')
ylim([-3 6])


% Απεικόνιση σημείων κατανομών και επιφάνειας απόφασης ερωτήματος γ
figure
hold
scatter(R1(:,1),R1(:,2))
scatter(R2(:,1),R2(:,2),'square')
plot(x,g3,'--')
grid
title('Naive Bayes Classifier')
legend('\omega_1 (\lambda_{12} = 1)','\omega_2 (\lambda_{21} = 0.5)')
xlabel('x_1')
ylabel('x_2')
ylim([-3 6])