%                         Μηχανική Μάθηση
%                   1η Σειρά Ασκήσεων 2023-2024
%                   Άσκηση 1.6: Decision Trees
% -------------------------------------------------------------------------
%                   Χαρίλαος Κουκουλάρης el18137
%                           1/12/2023

x1 = [1;0;1;1;0;1;0;0;0;1];
x2 = [0;1;0;0;1;0;1;0;0;0];
x3 = [1;0;1;1;0;1;1;0;1;0];
x4 = [0;1;0;1;0;1;0;0;0;0];
y = [ones(5,1);-ones(5,1)];

data = table(x1,x2,x3,x4,y)

% Αλγόριθμος εκπαίδευσης δέντρου απόφασης
DecisionTreeTrain(data,'entropy')
